; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v11 ?v4)
             (pred_2 ?v13 ?v9)
             (pred_10 ?v11 ?v9)
             (pred_9 ?v2 ?v11 )
	     (pred_5 ?v11)
             (pred_4 ?v6)
             (pred_1 ?v13)
             (pred_12 ?v9)
             (pred_7 ?v11)
             (pred_3 ?v13)
             (pred_6 ?v11)
             (pred_8 ))



(:action op_5
:parameters (?v3 ?v5 ?v10 ?v1)
:precondition (and (pred_4 ?v3) (pred_4 ?v5) (pred_1 ?v10) (pred_12 ?v1)
          (pred_11 ?v3 ?v5) (pred_2 ?v10 ?v1)
                   (pred_10 ?v5 ?v1) (pred_5 ?v3) 
                   (pred_7 ?v5) (pred_3 ?v10))
:effect (and  (pred_6 ?v5) (not (pred_7 ?v5))))


(:action op_4
:parameters (?v3 ?v8)
:precondition (and (pred_4 ?v3) (pred_4 ?v8)
               (pred_5 ?v3) (pred_11 ?v3 ?v8) (pred_6 ?v8))
:effect (and (pred_5 ?v8) (not (pred_5 ?v3))))

(:action op_3
:parameters (?v3 ?v10)
:precondition (and (pred_4 ?v3) (pred_1 ?v10) 
                  (pred_5 ?v3) (pred_9 ?v10 ?v3) (pred_8 ))
:effect (and (pred_3 ?v10)
   (not (pred_9 ?v10 ?v3)) (not (pred_8 ))))


(:action op_2
:parameters (?v3 ?v7 ?v12)
:precondition (and (pred_4 ?v3) (pred_1 ?v7) (pred_1 ?v12)
                  (pred_5 ?v3) (pred_3 ?v12) (pred_9 ?v7 ?v3))
:effect (and (pred_3 ?v7) (pred_9 ?v12 ?v3)
        (not (pred_3 ?v12)) (not (pred_9 ?v7 ?v3))))

(:action op_1
:parameters (?v3 ?v10)
:precondition (and (pred_4 ?v3) (pred_1 ?v10) 
                  (pred_5 ?v3) (pred_3 ?v10))
:effect (and (pred_8 ) (pred_9 ?v10 ?v3) (not (pred_3 ?v10)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_06 obj_12 obj_13 obj_10 obj_03 obj_21 obj_19 obj_18 obj_09 obj_01 obj_20 obj_16 obj_04 obj_08 obj_14
    obj_05 obj_15
    obj_11 obj_17 obj_07
    )

    (:init
       (pred_8)

       (pred_4 obj_02)
       (pred_4 obj_06)
       (pred_4 obj_12)
       (pred_4 obj_13)
       (pred_4 obj_10)
       (pred_4 obj_03)
       (pred_4 obj_21)
       (pred_4 obj_19)
       (pred_4 obj_18)
       (pred_4 obj_09)
       (pred_4 obj_01)
       (pred_4 obj_20)
       (pred_4 obj_16)
       (pred_4 obj_04)
       (pred_4 obj_08)
       (pred_4 obj_14)
       (pred_12 obj_05)
       (pred_12 obj_15)
       (pred_1 obj_11)
       (pred_1 obj_17)
       (pred_1 obj_07)

       (pred_11 obj_02 obj_10)
       (pred_11 obj_02 obj_06)
       (pred_11 obj_06 obj_03)
       (pred_11 obj_06 obj_12)
       (pred_11 obj_06 obj_02)
       (pred_11 obj_12 obj_21)
       (pred_11 obj_12 obj_13)
       (pred_11 obj_12 obj_06)
       (pred_11 obj_13 obj_19)
       (pred_11 obj_13 obj_12)
       (pred_11 obj_10 obj_18)
       (pred_11 obj_10 obj_03)
       (pred_11 obj_10 obj_02)
       (pred_11 obj_03 obj_09)
       (pred_11 obj_03 obj_21)
       (pred_11 obj_03 obj_06)
       (pred_11 obj_03 obj_10)
       (pred_11 obj_21 obj_01)
       (pred_11 obj_21 obj_19)
       (pred_11 obj_21 obj_12)
       (pred_11 obj_21 obj_03)
       (pred_11 obj_19 obj_20)
       (pred_11 obj_19 obj_13)
       (pred_11 obj_19 obj_21)
       (pred_11 obj_18 obj_16)
       (pred_11 obj_18 obj_09)
       (pred_11 obj_18 obj_10)
       (pred_11 obj_09 obj_04)
       (pred_11 obj_09 obj_01)
       (pred_11 obj_09 obj_03)
       (pred_11 obj_09 obj_18)
       (pred_11 obj_01 obj_08)
       (pred_11 obj_01 obj_20)
       (pred_11 obj_01 obj_21)
       (pred_11 obj_01 obj_09)
       (pred_11 obj_20 obj_14)
       (pred_11 obj_20 obj_19)
       (pred_11 obj_20 obj_01)
       (pred_11 obj_16 obj_04)
       (pred_11 obj_16 obj_18)
       (pred_11 obj_04 obj_08)
       (pred_11 obj_04 obj_09)
       (pred_11 obj_04 obj_16)
       (pred_11 obj_08 obj_14)
       (pred_11 obj_08 obj_01)
       (pred_11 obj_08 obj_04)
       (pred_11 obj_14 obj_20)
       (pred_11 obj_14 obj_08)
       (pred_7 obj_21)
       (pred_7 obj_01)
       (pred_7 obj_12)
       (pred_10  obj_21 obj_05)
       (pred_10  obj_01 obj_15)
       (pred_10  obj_12 obj_05)
       (pred_6 obj_02)
       (pred_6 obj_06)
       (pred_6 obj_13)
       (pred_6 obj_10)
       (pred_6 obj_03)
       (pred_6 obj_19)
       (pred_6 obj_18)
       (pred_6 obj_09)
       (pred_6 obj_20)
       (pred_6 obj_16)
       (pred_6 obj_04)
       (pred_6 obj_08)
       (pred_6 obj_14)

       (pred_2  obj_11 obj_05)
       (pred_2  obj_17 obj_15)
       (pred_2  obj_07 obj_15)
       (pred_9 obj_11 obj_09)
       (pred_9 obj_17 obj_19)
       (pred_9 obj_07 obj_19)
       (pred_5 obj_02)
    )

    (:goal (and
       (pred_9 obj_07 obj_01)
    ))
(:constraints
  (always (not (pred_5 obj_21)))
)
)

; plan
1. (op_4 obj_02 obj_06)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_06)
   goals met: 0 of 1
2. (op_4 obj_06 obj_03)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_03)
   goals met: 0 of 1
3. (op_4 obj_03 obj_09)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_09)
   goals met: 0 of 1
4. (op_3 obj_09 obj_11)
   deleted: (pred_9 obj_11 obj_09) (pred_8)
   added: (pred_3 obj_11)
   goals met: 0 of 1
5. (op_4 obj_09 obj_03)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_03)
   goals met: 0 of 1
6. (op_5 obj_03 obj_21 obj_11 obj_05)
   deleted: (pred_7 obj_21)
   added: (pred_6 obj_21)
   goals met: 0 of 1
7. (op_4 obj_03 obj_06)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_06)
   goals met: 0 of 1
8. (op_5 obj_06 obj_12 obj_11 obj_05)
   deleted: (pred_7 obj_12)
   added: (pred_6 obj_12)
   goals met: 0 of 1
9. (op_1 obj_06 obj_11)
   deleted: (pred_3 obj_11)
   added: (pred_8) (pred_9 obj_11 obj_06)
   goals met: 0 of 1
10. (op_4 obj_06 obj_12)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_12)
   goals met: 0 of 1
11. (op_4 obj_12 obj_13)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_13)
   goals met: 0 of 1
12. (op_4 obj_13 obj_19)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_19)
   goals met: 0 of 1
13. (op_3 obj_19 obj_07)
   deleted: (pred_9 obj_07 obj_19) (pred_8)
   added: (pred_3 obj_07)
   goals met: 0 of 1
14. (op_4 obj_19 obj_20)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_20)
   goals met: 0 of 1
15. (op_5 obj_20 obj_01 obj_07 obj_15)
   deleted: (pred_7 obj_01)
   added: (pred_6 obj_01)
   goals met: 0 of 1
16. (op_4 obj_20 obj_01)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_01)
   goals met: 0 of 1
17. (op_1 obj_01 obj_07)
   deleted: (pred_3 obj_07)
   added: (pred_8) (pred_9 obj_07 obj_01)
   goals met: 1 of 1
